Thanks @edwardmedia - yes the only change introduced in this case was the ssl policy. Looking back at the run output, it does also seem to want to change the ssl certificate reference as well from what looks like self link to id type of format:

```
Step #1 - "terraform-apply":   # module.my_module.module.lb.google_compute_region_target_https_proxy.default-https must be replaced
Step #1 - "terraform-apply": -/+ resource "google_compute_region_target_https_proxy" "default-https" {
Step #1 - "terraform-apply":       ~ creation_timestamp = "2023-03-14T14:10:37.152-07:00" -> (known after apply)
Step #1 - "terraform-apply":       ~ id                 = "projects/the-project/regions/northamerica-northeast1/targetHttpsProxies/https-proxy" -> (known after apply)
Step #1 - "terraform-apply":         name               = "https-proxy"
Step #1 - "terraform-apply":       ~ proxy_id           = 4360695795003776000 -> (known after apply)
Step #1 - "terraform-apply":       ~ self_link          = "https://www.googleapis.com/compute/v1/projects/the-project/regions/northamerica-northeast1/targetHttpsProxies/https-proxy" -> (known after apply)
Step #1 - "terraform-apply":       ~ ssl_certificates   = [
Step #1 - "terraform-apply":           - "https://www.googleapis.com/compute/v1/projects/the-project/regions/northamerica-northeast1/sslCertificates/the-cert",
Step #1 - "terraform-apply":           + "projects/the-project/regions/northamerica-northeast1/sslCertificates/the-cert",
Step #1 - "terraform-apply":         ]
Step #1 - "terraform-apply":       + ssl_policy         = (known after apply) # forces replacement
Step #1 - "terraform-apply":         # (3 unchanged attributes hidden)
Step #1 - "terraform-apply":     }
```

This run also was using the 5.3.0 version of the google provider at the time vs 5.11.0.